import MahanImage from "@/public/images/mahanImage2.jpg";
import Image from "next/image";

const AboutMe: React.FC = () => {
  return (
    <div className="about">
      <div className="about-container">
        <div className="about-tag-container">
          <p className="about-tag">درباره من</p>
        </div>
        <div className="about-space">
          {/* Image */}
          <div className="about-image-flex">
            <div className="about-image-position">
              <Image
                src={MahanImage}
                alt="Mahan Image"
                className="about-image"
                style={{ objectFit: "cover" }}
              ></Image>
              <div className="about-shape"></div>
            </div>
          </div>
          {/* content */}
          <span>
            <h3 className="about-title">
              اگر می‌خواهید بیشتر با من آشنا شوید، این بخش را از دست ندهید!
            </h3>
            <p className="about-caption">
                درباره من من یک توسعه‌دهنده فرانت‌اند هستم که عاشق خلق کردن و حل
                چالش‌های برنامه‌نویسی‌ام. بیش از یک سال است که در دنیای توسعه وب
                فعالیت می‌کنم و در این مدت، روی پروژه‌های مختلفی کار کرده‌ام که
                هرکدام برای من تجربه‌ای ارزشمند و جذاب به همراه داشته‌اند. چیزی که
                من را در این مسیر نگه می‌دارد، لذت دیدن خروجی کار و ساختن چیزهایی
                است که واقعاً کاربردی و زیبا هستند. مهارت‌ها و تکنولوژی‌ها تمرکز
                اصلی من روی توسعه فرانت‌اند با Next.js، React.js، TypeScript و
                TailwindCSS است. به استانداردهای SEO، بهینه‌سازی عملکرد، و ساختار
                اصولی پروژه‌ها اهمیت زیادی می‌دهم. من به ساختار پوشه‌ها، نام‌گذاری
                صحیح فایل‌ها و کدنویسی خوانا و مقیاس‌پذیر توجه ویژه‌ای دارم، چراکه
                باور دارم یک کد خوب باید علاوه بر کارایی، به سادگی قابل توسعه و
                نگهداری باشد. تجربه و پروژه‌ها اگرچه تجربه کار شرکتی رسمی ندارم، اما
                پروژه‌هایی مانند پیاده‌سازی لندینگ پیج برای شرکت فرآوردانه را انجام
                داده‌ام که نمونه‌ای از توانایی‌های من در توسعه وب است. در یکی از
                پروژه‌های شخصی‌ام، هنگام پیاده‌سازی فرم احراز هویت با RESTful API،
                با چالش‌های زیادی مواجه شدم اما با تحقیق، آزمون و خطا، و کمک گرفتن
                از منابعی مانند Stack Overflow توانستم این چالش را با موفقیت حل کنم.
                این تجربه، باعث شد درک عمیق‌تری از احراز هویت، اعتبارسنجی و تعامل
                فرانت‌اند با API به دست بیاورم. اهداف و مسیر آینده همیشه به‌روز بودن
                در حوزه فناوری برای من مهم است و به‌طور مداوم پیگیر آپدیت‌های React
                و Next.js هستم. هدف من این است که نمونه کارهای قوی‌تری بسازم و
                مهارت‌های خود را در پروژه‌هایی مانند وبسایت‌های فروشگاهی و پنل‌های
                ادمین توسعه دهم. در حال حاضر، ترجیح می‌دهم به عنوان توسعه‌دهنده
                فرانت‌اند در یک شرکت کار کنم تا تجربهdiscription بیشتری کسب کنم و به سطح
                بالاتری در این حوزه برسم. سبک زندگی و علایق علاوه بر برنامه‌نویسی،
                به ورزش کردن علاقه دارم و همیشه سعی می‌کنم بین کار و زندگی تعادل
                برقرار کنم. انگیزه اصلی من در پروژه‌های شخصی، یادگیری چیزهای جدید و
                ساختن یک رزومه قوی‌تر است، در حالی که در پروژه‌های کاری، هدفم کسب
                درآمد، سابقه و تجربه حرفه‌ای است.
            </p>
          </span>
        </div>
      </div>
    </div>
  );
};

export default AboutMe;
